Revit 2015 API
ViewSheet.Views Property
Returns the set of all views on the sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2015.  Use GetAllPlacedViews() instead.")]
public ViewSet Views { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2015.  Use GetAllPlacedViews() instead.")> _
Public ReadOnly Property Views As ViewSet
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2015.  Use GetAllPlacedViews() instead.")]
public:
property ViewSet^ Views {
	ViewSet^ get ();
}
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace